# 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка,
# стоящих на нечётной позиции.
#
# Пример:
#
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# def summa_nechetnyh(spisok):
#     i = 1
#     summa = 0
#     while i < len(spisok):
#         summa += spisok[i]
#         i += 2
#     return summa
#
# print(summa_nechetnyh([2, 3, 5, 9, 3, 4, 5]))